{"class_name": "Model", "config": {"name": "i3d_inception", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "Conv3d_1a_7x7_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_1a_7x7_conv", "trainable": true, "filters": 64, "kernel_size": [7, 7, 7], "strides": [2, 2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "Conv3d_1a_7x7_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_1a_7x7_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_1a_7x7_conv", 0, 0, {}]]]}, {"name": "Conv3d_1a_7x7", "class_name": "Activation", "config": {"name": "Conv3d_1a_7x7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_1a_7x7_bn", 0, 0, {}]]]}, {"name": "MaxPool2d_2a_3x3", "class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_2a_3x3", "trainable": true, "pool_size": [1, 3, 3], "padding": "same", "strides": [1, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Conv3d_1a_7x7", 0, 0, {}]]]}, {"name": "Conv3d_2b_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_2b_1x1_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_2a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_2b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_2b_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_2b_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_2b_1x1", "class_name": "Activation", "config": {"name": "Conv3d_2b_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_2b_1x1_bn", 0, 0, {}]]]}, {"name": "Conv3d_2c_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_2c_3x3_conv", "trainable": true, "filters": 192, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_2b_1x1", 0, 0, {}]]]}, {"name": "Conv3d_2c_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_2c_3x3_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_2c_3x3_conv", 0, 0, {}]]]}, {"name": "Conv3d_2c_3x3", "class_name": "Activation", "config": {"name": "Conv3d_2c_3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_2c_3x3_bn", 0, 0, {}]]]}, {"name": "MaxPool2d_3a_3x3", "class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_3a_3x3", "trainable": true, "pool_size": [1, 3, 3], "padding": "same", "strides": [1, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Conv3d_2c_3x3", 0, 0, {}]]]}, {"name": "Conv3d_3b_1a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3b_1a_1x1_conv", "trainable": true, "filters": 96, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_3a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_3b_2a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3b_2a_1x1_conv", "trainable": true, "filters": 16, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_3a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_3b_1a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3b_1a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3b_1a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_3b_2a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3b_2a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3b_2a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_3b_1a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_3b_1a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3b_1a_1x1_bn", 0, 0, {}]]]}, {"name": "Conv3d_3b_2a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_3b_2a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3b_2a_1x1_bn", 0, 0, {}]]]}, {"name": "MaxPool2d_3b_3a_3x3", "class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_3b_3a_3x3", "trainable": true, "pool_size": [3, 3, 3], "padding": "same", "strides": [1, 1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["MaxPool2d_3a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_3b_0a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3b_0a_1x1_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_3a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_3b_1b_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3b_1b_3x3_conv", "trainable": true, "filters": 128, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_3b_1a_1x1", 0, 0, {}]]]}, {"name": "Conv3d_3b_2b_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3b_2b_3x3_conv", "trainable": true, "filters": 32, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_3b_2a_1x1", 0, 0, {}]]]}, {"name": "Conv3d_3b_3b_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3b_3b_1x1_conv", "trainable": true, "filters": 32, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_3b_3a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_3b_0a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3b_0a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3b_0a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_3b_1b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3b_1b_3x3_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3b_1b_3x3_conv", 0, 0, {}]]]}, {"name": "Conv3d_3b_2b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3b_2b_3x3_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3b_2b_3x3_conv", 0, 0, {}]]]}, {"name": "Conv3d_3b_3b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3b_3b_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3b_3b_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_3b_0a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_3b_0a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3b_0a_1x1_bn", 0, 0, {}]]]}, {"name": "Conv3d_3b_1b_3x3", "class_name": "Activation", "config": {"name": "Conv3d_3b_1b_3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3b_1b_3x3_bn", 0, 0, {}]]]}, {"name": "Conv3d_3b_2b_3x3", "class_name": "Activation", "config": {"name": "Conv3d_3b_2b_3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3b_2b_3x3_bn", 0, 0, {}]]]}, {"name": "Conv3d_3b_3b_1x1", "class_name": "Activation", "config": {"name": "Conv3d_3b_3b_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3b_3b_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_3b", "class_name": "Concatenate", "config": {"name": "Mixed_3b", "trainable": true, "axis": 4}, "inbound_nodes": [[["Conv3d_3b_0a_1x1", 0, 0, {}], ["Conv3d_3b_1b_3x3", 0, 0, {}], ["Conv3d_3b_2b_3x3", 0, 0, {}], ["Conv3d_3b_3b_1x1", 0, 0, {}]]]}, {"name": "Conv3d_3c_1a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3c_1a_1x1_conv", "trainable": true, "filters": 128, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3b", 0, 0, {}]]]}, {"name": "Conv3d_3c_2a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3c_2a_1x1_conv", "trainable": true, "filters": 32, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3b", 0, 0, {}]]]}, {"name": "Conv3d_3c_1a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3c_1a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3c_1a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_3c_2a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3c_2a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3c_2a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_3c_1a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_3c_1a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3c_1a_1x1_bn", 0, 0, {}]]]}, {"name": "Conv3d_3c_2a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_3c_2a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3c_2a_1x1_bn", 0, 0, {}]]]}, {"name": "MaxPool2d_3c_3a_3x3", "class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_3c_3a_3x3", "trainable": true, "pool_size": [3, 3, 3], "padding": "same", "strides": [1, 1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["Mixed_3b", 0, 0, {}]]]}, {"name": "Conv3d_3c_0a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3c_0a_1x1_conv", "trainable": true, "filters": 128, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_3b", 0, 0, {}]]]}, {"name": "Conv3d_3c_1b_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3c_1b_3x3_conv", "trainable": true, "filters": 192, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_3c_1a_1x1", 0, 0, {}]]]}, {"name": "Conv3d_3c_2b_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3c_2b_3x3_conv", "trainable": true, "filters": 96, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_3c_2a_1x1", 0, 0, {}]]]}, {"name": "Conv3d_3c_3b_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_3c_3b_1x1_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_3c_3a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_3c_0a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3c_0a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3c_0a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_3c_1b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3c_1b_3x3_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3c_1b_3x3_conv", 0, 0, {}]]]}, {"name": "Conv3d_3c_2b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3c_2b_3x3_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3c_2b_3x3_conv", 0, 0, {}]]]}, {"name": "Conv3d_3c_3b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_3c_3b_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_3c_3b_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_3c_0a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_3c_0a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3c_0a_1x1_bn", 0, 0, {}]]]}, {"name": "Conv3d_3c_1b_3x3", "class_name": "Activation", "config": {"name": "Conv3d_3c_1b_3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3c_1b_3x3_bn", 0, 0, {}]]]}, {"name": "Conv3d_3c_2b_3x3", "class_name": "Activation", "config": {"name": "Conv3d_3c_2b_3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3c_2b_3x3_bn", 0, 0, {}]]]}, {"name": "Conv3d_3c_3b_1x1", "class_name": "Activation", "config": {"name": "Conv3d_3c_3b_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_3c_3b_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_3c", "class_name": "Concatenate", "config": {"name": "Mixed_3c", "trainable": true, "axis": 4}, "inbound_nodes": [[["Conv3d_3c_0a_1x1", 0, 0, {}], ["Conv3d_3c_1b_3x3", 0, 0, {}], ["Conv3d_3c_2b_3x3", 0, 0, {}], ["Conv3d_3c_3b_1x1", 0, 0, {}]]]}, {"name": "MaxPool2d_4a_3x3", "class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_4a_3x3", "trainable": true, "pool_size": [3, 3, 3], "padding": "same", "strides": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["Mixed_3c", 0, 0, {}]]]}, {"name": "Conv3d_4b_1a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4b_1a_1x1_conv", "trainable": true, "filters": 96, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_4a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_4b_2a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4b_2a_1x1_conv", "trainable": true, "filters": 16, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_4a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_4b_1a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4b_1a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4b_1a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_4b_2a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4b_2a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4b_2a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_4b_1a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_4b_1a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4b_1a_1x1_bn", 0, 0, {}]]]}, {"name": "Conv3d_4b_2a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_4b_2a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4b_2a_1x1_bn", 0, 0, {}]]]}, {"name": "MaxPool2d_4b_3a_3x3", "class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_4b_3a_3x3", "trainable": true, "pool_size": [3, 3, 3], "padding": "same", "strides": [1, 1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["MaxPool2d_4a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_4b_0a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4b_0a_1x1_conv", "trainable": true, "filters": 192, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_4a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_4b_1b_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4b_1b_3x3_conv", "trainable": true, "filters": 208, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_4b_1a_1x1", 0, 0, {}]]]}, {"name": "Conv3d_4b_2b_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4b_2b_3x3_conv", "trainable": true, "filters": 48, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_4b_2a_1x1", 0, 0, {}]]]}, {"name": "Conv3d_4b_3b_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4b_3b_1x1_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_4b_3a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_4b_0a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4b_0a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4b_0a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_4b_1b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4b_1b_3x3_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4b_1b_3x3_conv", 0, 0, {}]]]}, {"name": "Conv3d_4b_2b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4b_2b_3x3_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4b_2b_3x3_conv", 0, 0, {}]]]}, {"name": "Conv3d_4b_3b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4b_3b_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4b_3b_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_4b_0a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_4b_0a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4b_0a_1x1_bn", 0, 0, {}]]]}, {"name": "Conv3d_4b_1b_3x3", "class_name": "Activation", "config": {"name": "Conv3d_4b_1b_3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4b_1b_3x3_bn", 0, 0, {}]]]}, {"name": "Conv3d_4b_2b_3x3", "class_name": "Activation", "config": {"name": "Conv3d_4b_2b_3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4b_2b_3x3_bn", 0, 0, {}]]]}, {"name": "Conv3d_4b_3b_1x1", "class_name": "Activation", "config": {"name": "Conv3d_4b_3b_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4b_3b_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_4b", "class_name": "Concatenate", "config": {"name": "Mixed_4b", "trainable": true, "axis": 4}, "inbound_nodes": [[["Conv3d_4b_0a_1x1", 0, 0, {}], ["Conv3d_4b_1b_3x3", 0, 0, {}], ["Conv3d_4b_2b_3x3", 0, 0, {}], ["Conv3d_4b_3b_1x1", 0, 0, {}]]]}, {"name": "Conv3d_4c_1a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4c_1a_1x1_conv", "trainable": true, "filters": 112, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4b", 0, 0, {}]]]}, {"name": "Conv3d_4c_2a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4c_2a_1x1_conv", "trainable": true, "filters": 24, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4b", 0, 0, {}]]]}, {"name": "Conv3d_4c_1a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4c_1a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4c_1a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_4c_2a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4c_2a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4c_2a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_4c_1a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_4c_1a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4c_1a_1x1_bn", 0, 0, {}]]]}, {"name": "Conv3d_4c_2a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_4c_2a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4c_2a_1x1_bn", 0, 0, {}]]]}, {"name": "MaxPool2d_4c_3a_3x3", "class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_4c_3a_3x3", "trainable": true, "pool_size": [3, 3, 3], "padding": "same", "strides": [1, 1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["Mixed_4b", 0, 0, {}]]]}, {"name": "Conv3d_4c_0a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4c_0a_1x1_conv", "trainable": true, "filters": 160, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4b", 0, 0, {}]]]}, {"name": "Conv3d_4c_1b_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4c_1b_3x3_conv", "trainable": true, "filters": 224, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_4c_1a_1x1", 0, 0, {}]]]}, {"name": "Conv3d_4c_2b_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4c_2b_3x3_conv", "trainable": true, "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_4c_2a_1x1", 0, 0, {}]]]}, {"name": "Conv3d_4c_3b_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4c_3b_1x1_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPool2d_4c_3a_3x3", 0, 0, {}]]]}, {"name": "Conv3d_4c_0a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4c_0a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4c_0a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_4c_1b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4c_1b_3x3_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4c_1b_3x3_conv", 0, 0, {}]]]}, {"name": "Conv3d_4c_2b_3x3_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4c_2b_3x3_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4c_2b_3x3_conv", 0, 0, {}]]]}, {"name": "Conv3d_4c_3b_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4c_3b_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4c_3b_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_4c_0a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_4c_0a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4c_0a_1x1_bn", 0, 0, {}]]]}, {"name": "Conv3d_4c_1b_3x3", "class_name": "Activation", "config": {"name": "Conv3d_4c_1b_3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4c_1b_3x3_bn", 0, 0, {}]]]}, {"name": "Conv3d_4c_2b_3x3", "class_name": "Activation", "config": {"name": "Conv3d_4c_2b_3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4c_2b_3x3_bn", 0, 0, {}]]]}, {"name": "Conv3d_4c_3b_1x1", "class_name": "Activation", "config": {"name": "Conv3d_4c_3b_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4c_3b_1x1_bn", 0, 0, {}]]]}, {"name": "Mixed_4c", "class_name": "Concatenate", "config": {"name": "Mixed_4c", "trainable": true, "axis": 4}, "inbound_nodes": [[["Conv3d_4c_0a_1x1", 0, 0, {}], ["Conv3d_4c_1b_3x3", 0, 0, {}], ["Conv3d_4c_2b_3x3", 0, 0, {}], ["Conv3d_4c_3b_1x1", 0, 0, {}]]]}, {"name": "Conv3d_4d_1a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4d_1a_1x1_conv", "trainable": true, "filters": 128, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4c", 0, 0, {}]]]}, {"name": "Conv3d_4d_2a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4d_2a_1x1_conv", "trainable": true, "filters": 24, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4c", 0, 0, {}]]]}, {"name": "Conv3d_4d_1a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4d_1a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4d_1a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_4d_2a_1x1_bn", "class_name": "BatchNormalization", "config": {"name": "Conv3d_4d_2a_1x1_bn", "trainable": true, "axis": 4, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv3d_4d_2a_1x1_conv", 0, 0, {}]]]}, {"name": "Conv3d_4d_1a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_4d_1a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4d_1a_1x1_bn", 0, 0, {}]]]}, {"name": "Conv3d_4d_2a_1x1", "class_name": "Activation", "config": {"name": "Conv3d_4d_2a_1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["Conv3d_4d_2a_1x1_bn", 0, 0, {}]]]}, {"name": "MaxPool2d_4d_3a_3x3", "class_name": "MaxPooling3D", "config": {"name": "MaxPool2d_4d_3a_3x3", "trainable": true, "pool_size": [3, 3, 3], "padding": "same", "strides": [1, 1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["Mixed_4c", 0, 0, {}]]]}, {"name": "Conv3d_4d_0a_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4d_0a_1x1_conv", "trainable": true, "filters": 128, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Mixed_4c", 0, 0, {}]]]}, {"name": "Conv3d_4d_1b_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4d_1b_3x3_conv", "trainable": true, "filters": 256, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_4d_1a_1x1", 0, 0, {}]]]}, {"name": "Conv3d_4d_2b_3x3_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4d_2b_3x3_conv", "trainable": true, "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Conv3d_4d_2a_1x1", 0, 0, {}]]]}, {"name": "Conv3d_4d_3b_1x1_conv", "class_name": "Conv3D", "config": {"name": "Conv3d_4d_3b_1x1_conv", "trainable": true, "filters": 64, "kernel_size": [1, 1, 1], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, 